БИТУправление_медицинским_центром_демо/src/DataProcessors/ИнтерфейсВводаПолейЭМД/ИнтерфейсВводаПолейЭМД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИнтерфейсВводаПолейЭМД</name>
  <comment>Для избранных полей особые формы ввода</comment>
</mdclass:DataProcessor>

БИТУправление_медицинским_центром_демо/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <predefined>
    <items>
      <name>Skype</name>
      <description>Skype</description>
    </items>
    <items>
      <name>АдресИностранный</name>
      <description>Адрес за пределами РФ</description>
    </items>
    <items>
      <name>АдресМестаРождения</name>
      <description>Адрес места рождения</description>
    </items>
    <items>
      <name>АдресЭлектроннойПочтыДомашний</name>
      <description>Адрес электронной почты (личный)</description>
    </items>
    <items>
      <name>АдресЭлектроннойПочтыРабочий</name>
      <description>Адрес электронной почты (рабочий)</description>
    </items>
    <items>
      <name>ВебСтраницаОрганизации</name>
      <description>Веб-страница организации</description>
    </items>
    <items>
      <name>ТелефонДомашний</name>
      <description>Домашний телефон</description>
    </items>
    <items>
      <name>ВебСтраницаФизЛица</name>
      <description>Домашняя веб-страница</description>
    </items>
    <items>
      <name>НомерПрочий</name>
      <description>Номер прочий</description>
    </items>
    <items>
      <name>АдресПочтовый</name>
      <description>Почтовый адрес</description>
    </items>
    <items>
      <name>ПрочаяИнформация</name>
      <description>Прочая информация</description>
    </items>
    <items>
      <name>ТелефонРабочий</name>
      <description>Рабочий телефон</description>
    </items>
    <items>
      <name>ТелефонСотовый</name>
      <description>Сотовый телефон</description>
    </items>
    <items>
      <name>ТелефонКонтрагента</name>
      <description>Телефон контрагента</description>
    </items>
    <items>
      <name>ТелефонОрганизации</name>
      <description>Телефон организации</description>
    </items>
    <items>
      <name>Факс</name>
      <description>Факс</description>
    </items>
    <items>
      <name>АдресФактический</name>
      <description>Фактический адрес</description>
    </items>
    <items>
      <name>АдресЮридический</name>
      <description>Юридический адрес (адрес регистрации)</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <comment>Тип контактной информации</comment>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьМаскуВвода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаскаВводаТелефонногоНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <comment>Не используется</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеТолькоВДиалоге</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <comment>Не используется</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактируетсяВФормеОбъекта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/DataProcessors/ИнтерфейсВводаПолейЭМД/Forms/ВводОрганизацииСАдресом/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Параметр") Тогда
		Параметр = Параметры.Параметр;		
	ИначеЕсли Параметры.Свойство("КодировкаПоля") Тогда 
		Параметр = Параметры.КодировкаПоля;	
	КонецЕсли;     
	
	ТипУчреждения = Элементы.ТипУчреждения.СписокВыбора[0].Значение;
	ВыводитьАдрес = Истина;  
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриИзмененииТипаУчреждения();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	
	ЭтотОбъект.Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтотОбъект.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипУчрежденияПриИзменении(Элемент)
	
	ПриИзмененииТипаУчреждения();
	
КонецПроцедуры 

&НаКлиенте
Процедура УчреждениеПриИзменении(Элемент)
	
	Результат = РассчитатьРезультат(Учреждение, ВыводитьАдрес);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьАдресПриИзменении(Элемент)
	
	Результат = РассчитатьРезультат(Учреждение, ВыводитьАдрес);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	ЭтотОбъект.ТекущийЭлемент = Элементы.ФормаСохранить;
	
	Оповещение = Новый ОписаниеОповещения("РезультатКонецВыбора", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ФормаВводаТекста",Новый Структура("Параметр, Текст", Параметр, Результат),Элементы.Результат, УникальныйИдентификатор,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Процедура ПриИзмененииТипаУчреждения()

	Если ТипУчреждения = 1 Тогда
		ОжидаемыйТип = Тип("СправочникСсылка.Контрагенты");
	ИначеЕсли ТипУчреждения = 2 Тогда
		ОжидаемыйТип = Тип("СправочникСсылка.Филиалы");
	Иначе
		Возврат;
	КонецЕсли;
	
	// Создаем описание типа.
	ТипыДляОписания = Новый Массив;
	ТипыДляОписания.Добавить(ОжидаемыйТип);
	ОписаниеТипа = Новый ОписаниеТипов(ТипыДляОписания);
	
	// Приведение значения
	Учреждение = ОписаниеТипа.ПривестиЗначение(Учреждение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РассчитатьРезультат(Учреждение, ВыводитьАдрес)
	
	Результат = "";
	
	Если ЗначениеЗаполнено(Учреждение)
		И ТипЗнч(Учреждение) <> Тип("Строка")
	Тогда
		Если ТипЗнч(Учреждение) = Тип("СправочникСсылка.Филиалы") Тогда
			НаименованиеУчреждения = Учреждение.Организация.НаименованиеПолное;
			
			Если ВыводитьАдрес Тогда
				Адрес = Справочники.Филиалы.ПолучитьКИ(Учреждение, Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.АдресФактический);
				Если Не ЗначениеЗаполнено(Адрес) Тогда
					Адрес = Справочники.Филиалы.ПолучитьКИ(Учреждение, Перечисления.ТипыКонтактнойИнформации.Адрес);
				КонецЕсли;
			Иначе
				Адрес = "";
			КонецЕсли;
		Иначе
			НаименованиеУчреждения = ?(ЗначениеЗаполнено(Учреждение.НаименованиеПолное), Учреждение.НаименованиеПолное, Учреждение.Наименование);
			Если ВыводитьАдрес Тогда
				Адрес = КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(Учреждение, Перечисления.ТипыКонтактнойИнформации.Адрес);
			Иначе
				Адрес = "";
			КонецЕсли;
		КонецЕсли;
		
		Результат = НаименованиеУчреждения;
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(Результат, Адрес,,Истина);
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура РезультатКонецВыбора(Текст, ДополнительныеПараметры) Экспорт
	
	Если Текст <> Неопределено Тогда
		Результат = Текст;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
